print("")
print("=====Переменные заданы кодом=====")
print("")
a = 20
b = 5
print("a = ", a)
print("b = ", b)
print("a + b = ", a + b)

print("")
print("=====Переменные вводит пользователь=====")
print("=====Приведение типов при выводе=====")
print("")
a = input("Введите целое значение для 'a':")
b = input("Введите целое значение для 'b':")
print("a = ", int(a))
print("b = ", int(b))
print("a + b = ", int(a) + int(b))

print("")
print("=====Переменные вводит пользователь=====")
print("=====Приведение типов при вводе=====")
print("")
a = float(input("Введите вещественное значение для 'a':"))
b = float(input("Введите вещественное значение для 'b':"))
print("a = ", a)
print("b = ", b)
print("a + b = ", a + b)

print("")
print("=====Сравнение двух значений=====")
print("")
a = int(input("Введите целое значение для 'a':"))
b = int(input("Введите целое значение для 'b':"))
if a>b:
    print("a больше b")
elif a<b:
    print("b больше a")
else:
    print("a и b равны")

print("")
print("=====Работа со строками=====")
print("")
a = "Строка"
print("a = ", a)
a = a + " дополнена " + "новой строкой"
print("a = ", a)
a = "Строка %s" % "с форматом"
print("a = ", a)
a = input("Введите Имя:")
print("Привет, %s! Как дела?" % a)